CREATE OR REPLACE FUNCTION get_place_type_id(key text) RETURNS uuid AS $$
BEGIN
    RETURN CASE key
        /* *************************************************************************
         * HARRY POTTER
         * ************************************************************************* */
        WHEN 'country'  THEN '0000001-0003-0001-0000-000000000001'::uuid
        WHEN 'state'    THEN '0000001-0003-0001-0000-000000000002'::uuid
        WHEN 'province' THEN '0000001-0003-0001-0000-000000000003'::uuid
        WHEN 'city'     THEN '0000001-0003-0001-0000-000000000004'::uuid
        WHEN 'town'     THEN '0000001-0003-0001-0000-000000000005'::uuid
        WHEN 'village'  THEN '0000001-0003-0001-0000-000000000006'::uuid
        WHEN 'address'  THEN '0000001-0003-0001-0000-000000000007'::uuid
        WHEN 'cemetery' THEN '0000001-0003-0001-0000-000000000008'::uuid
        WHEN 'church'   THEN '0000001-0003-0001-0000-000000000009'::uuid
        WHEN 'hospital' THEN '0000001-0003-0001-0000-000000000010'::uuid
        WHEN 'other'    THEN '0000001-0003-0001-0000-000000000011'::uuid
            
        /* *************************************************************************
         * GAME OF THRONES
         * ************************************************************************* */
        -- TODO: Add Game of Thrones place types

        /* *************************************************************************
         * NOS ÉTÉS
         * ************************************************************************* */
        -- TODO: Add Nos Étés place types

        ELSE NULL
    END;
END;
$$ LANGUAGE plpgsql IMMUTABLE; 
